---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LoadAllNon0Loads
source: html/a76dde89-b1f9-d235-a324-77a43ed0f406.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LoadAllNon0Loads Property

"All non 0 loads"

## Syntax (C#)
```csharp
public static ForgeTypeId LoadAllNon0Loads { get; }
```